export const backs = [
    { from: '分類', to: ['誰比較多', '加法', '數氣球', '認識數字']},
    { from: '誰比較多', to: ['減法']},
    { from: '數氣球', to: ['加法', '減法']},
    { from: '加法', to: ['減法', '乘法A~D', '認識十進位', '百數表'] },
    { from: '減法', to: ['除法', '正負數', '認識十進位'] },
    { from: '百數表', to: ['乘法A~D', '因數與倍數'] },
    { from: '乘法A~D', to: ['乘法E~F', '除法'] },
    { from: '乘法E~F', to: ['除法', '代數入門'] },
    { from: '除法', to: ['除法直式的意涵', '分數', '因數與倍數', '代數入門'] },
    { from: '分數', to: ['因數與倍數', '代數入門', '正負分數'] },
    { from: '數線', to: ['不等式', '正負數', '代數入門', '直角座標'] },
    { from: '代數入門', to: ['一元一次方程式'] }
]